<template>
    <div class="info1">
        <HeaderA />
        <div class="title">
            VP002 (11.0.1.106(C04E18R1P2)) 预置应用软件信息公示
        </div>
        <div class="table-wrap">
            <table cellpadding="0" cellspacing="0" v-show="index == 1">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>58同城</td>
                    <td>58同城是生活服务信 息平台，海量生活信息免费查询、发布。各项生活信息真实、高效、免费，让生活更简单!</td>
                    <td>北京城市网邻信息技术有限公司天津分公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，存储，网络通信</td>
                </tr>
                <tr>
                    <td>安全组件</td>
                    <td>安全组件支持插件化应用，主要为系统应用提供即时弹窗式生物认证或密码认证能力。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>百度</td>
                    <td>手机百度是一款手机搜索客户端，依托百度网页、百度图片、百度新闻、百度知道、百度百科、百度地图、百度音乐、百度视频等专业垂直搜索频道，方便用户随时随地使用百度搜索服务。</td>
                    <td>百度在线网络技术(北京)有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>百度输入法华为版</td>
                    <td>百度输入法华为版</td>
                    <td>百度有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，信息，麦克风，相机，通讯录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>备份</td>
                    <td>您可以通过备份应用备份设备上的个人数据 (如联系人、信息、通话记录)、应用数据或多媒体数据，避免系统升级、刷机后数据丢失。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，通讯录，历史记录、书签，日历，通话记录，存储，网络通信</td>
                </tr>
                <tr>
                    <td>备忘录</td>
                    <td>协助进行事物分类和管理</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，麦克风，相机，存储，网络通信</td>
                </tr>
                <tr>
                    <td>拨号服务</td>
                    <td>通话应用中connection服务及通话设置、移动网络设置等在此apk中实现 。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，通讯录，通话记录，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>查找设备</td>
                    <td>开启查找我的手机功能后，您可以使用查找我的手机查看、定位设备位置信息，锁 定、擦除设备上的数据。</td>
                    <td>华为软件 技术有限 公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，存储，网络通信</td>
                </tr>
                <tr>
                    <td>存储空间管理器</td>
                    <td>存储空间管理器。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储</td>
                </tr>
                <tr>
                    <td>存储已屏蔽的号码</td>
                    <td>为通讯录，短信或者其他模块提供黑名单的增删、改查数据操作。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 2">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>打包安装程序</td>
                    <td>打包安装程序是管理应用权限与动态授权，并且提供给用户安装、卸载能力的软件。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>打印处理服务</td>
                    <td>提供打印预览功能、以及保存pdf和打印入口。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息</td>
                </tr>
                <tr>
                    <td>电话</td>
                    <td>此apk是通话应用中通话界面部分的流程及显示控制部分。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，麦克风，相机，通讯录，日历，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>电子邮件</td>
                    <td>协助实现手机上简洁高效地管理各类邮箱，支持收发邮件，同步联系人、日历。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，通讯录，日历，存储，网络通信</td>
                </tr>
                <tr>
                    <td>抖音</td>
                    <td>抖音是一款音乐短视频社区产品，用户可以使用独特有趣的拍摄和编辑工具，配合音乐录制短视频，并基于创意作品分享互动。</td>
                    <td>北京微播世界科技有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>饿了么</td>
                    <td>饿了么，主要是专业的本地生活服务平台，提供安全、方便、快捷、贴心的高品质外卖服务。饿了么现覆盖全国670个城市和逾千个县，在线餐厅340万家，50000+高端品牌连锁餐厅</td>
                    <td>上海拉扎斯信息科技有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，日历，存储，网络通信</td>
                </tr>
                <tr>
                    <td>高德地图</td>
                    <td>高德地图是为用户提供包括智能路线规划、智能导航(驾车、步行、骑行)、实时路况等出行相关服务的平台。</td>
                    <td>高德软件 有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>跟随设备管理器</td>
                    <td>设备连接管理器，用于搜索穿戴设备，以及进行配对和连接。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>工程菜单</td>
                    <td>支持系统单板、网络 等信息查询。</td>
                    <td>华为终端 有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>工作资料设 置</td>
                    <td>提供AFW的ManagedProvisionin g功能。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 3">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>关键资产同步</td>
                    <td>负责同账号下在完全可信设备间安全同步高敏感加密数据。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>关键资产同步管理服务</td>
                    <td>负责监控高敏感加密数据的变化，通知关键资产同步应用监控数据变化，触发对应的数据同步。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>滚动截屏</td>
                    <td>滚动截屏，用于对较长的页面进行多段式截屏，并完整拼接成一张图片的功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储</td>
                </tr>
                <tr>
                    <td>好看视频</td>
                    <td>好看视频是由百度团队打造集内涵和颜值于一身的专业短视频聚合平台。</td>
                    <td>百度在线网络技术(北京)有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>号码识别</td>
                    <td>联系人号码识别应用，提供号码标记、号码归属地、黄页功能 。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>华为RCS服务</td>
                    <td>华为Rcs服务，为短信、联系人、通话等应用提供Rcs功能接口，无须安装第三方应用，即可在短信中发送语音、图片或视频、共享位置或其他操作，给您提供一种新型、便捷的沟通体验。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，信息，通讯录，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>华为安全公共服务</td>
                    <td>安全特性的公共进程服务</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表，位置信息，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>华为地图服务</td>
                    <td>华为地图定位服务软件，提供手机定位服务功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>华为服务框架</td>
                    <td>华为扩展的Framework基础框架能力，用于对接部分华为自研应用。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>华为钱包</td>
                    <td>华为生活服务是华为官方推出的生活消费类软件，您可以使用华为生活服务为手机充话费、流量、海外购物、订酒店、订机 票、打车、查询快递等。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，相机，日历，存储，网络通信</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 4">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>华为收音机</td>
                    <td>提供收音机功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，麦克风，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>华为游戏中心</td>
                    <td>华为游戏中心是华为为游戏开发者和用户提供的服务平台，旨在为您推荐安全、高质量的游戏及丰富便捷的游戏服务。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，相机，通讯录，存储，网络通信</td>
                </tr>
                <tr>
                    <td>华为智慧引擎</td>
                    <td>Huawei HiAI Engine</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，麦克风，通讯录，日历，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>华为智慧助手·今天</td>
                    <td>您身边“无微不智”的个人助理，为你提供贴心、精准、便捷的场景化服务，守护您的每个「今天」</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，信息，通讯录，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>华为智能建议</td>
                    <td>根据用户使用手机的习惯，提供个性化的服务</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>华为桌面</td>
                    <td>在桌面显示各个应用的图标、并启动登录应用。</td>
                    <td>华为</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，信息，通讯录，日历，存储，网络通信</td>
                </tr>
                <tr>
                    <td>会员中心</td>
                    <td>以“我”为中心，统一管理与华为交互产生的数据、资产、权益;总览、参与华为官方的会员成长与粉丝活动</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，相机，日历，存储，网络通信</td>
                </tr>
                <tr>
                    <td>基本互动屏保</td>
                    <td>充电待机时、屏幕上显示的互动屏保。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>计算器</td>
                    <td>提供计算器功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>健康使用手机</td>
                    <td>供用户管理和统计屏幕使用时间，并将孩子的位置信息共享给家长。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，存储，网络通信，蓝牙</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 5">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>今日头条</td>
                    <td>今日头条是一款基于数据挖掘技术的个性化推荐引擎产品，它为用户推荐有价值的、个性化的信息，提供连接人与信息的新型服务</td>
                    <td>北京字节跳动科技有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>紧急信息</td>
                    <td>此应用是提供了一个查看个人紧急信息的入口，当用户遇到紧急事件时，用户或者其他人，可以通过紧急拨号的入口查看你的个人紧急信息。可添加紧急个人信息内容如下:
                        1、可添加个人信息到紧急信息里面，包括姓名、地址、血型、过敏反 应等个人信息。 2、可添加多名紧急联系人到紧急信息里面，包括联系人名称和号码。
                    </td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，通讯录，存储，网络通信</td>
                </tr>
                <tr>
                    <td>京东</td>
                    <td>京东APP是一款移动购物软件，具有商品搜索/浏览、评论查阅、商品购买、在线 支付/货到付款、订单查询、物流跟踪、晒单/评价、返修退货等功能，为您打造简单、快乐的生活体验。</td>
                    <td>北京京东世纪贸易有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>精品推荐</td>
                    <td>云文件夹，在您使用“精品推荐”文件夹的应用时，给您提供TOP级精品应用的推荐服务，让您轻松发现实用、好用的手机应用。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>快手</td>
                    <td>快手是记录和分享生活的平台，是一款将视频转化为GIF格式图片的工具，转化后用户可以分享至微博、QQ空间。</td>
                    <td>北京一笑科技发展有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>快应用中心</td>
                    <td>用于执行和管理快应用。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，麦克风，相机，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>蓝牙</td>
                    <td>蓝牙是一种无线技术标准，可实现固定设备、移动设备和楼宇个人域网之间的短距离数据交换（使用2.4—2.485GHz的ISM波段的UHF无线电波），可实现文件传输，听音乐，以及穿戴设备使用等功能。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，通讯录，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>联系人</td>
                    <td>联系人信息查看与编辑入口，可切换到电话页面进行拨号和查看通话记录。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，信息，麦克风，通讯录，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>联系人存储</td>
                    <td>联系人、通话记录相关数据的数据库。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，通讯录，日历，通话记录</td>
                </tr>
                <tr>
                    <td>联系人同步</td>
                    <td>联系人云同步。此应用用于支持设备与华为云服务之间的联系人同步业务。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，通讯录，通话记录，网络通信</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 6">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>浏览器</td>
                    <td>华为浏览器是一款高速、安全、稳定的浏览器，同时具备恶意网址拦截，网页广告过滤，书签云同步等特色功能，欢迎体验。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，存储，网络通信</td>
                </tr>
                <tr>
                    <td>录音机</td>
                    <td>提供录音功能。</td>
                    <td>华为终端有限公司</td>
                    <td>读取已安装应用列表，麦克风，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>媒体存储</td>
                    <td>媒体数据库，是图库、音乐、视频应用的本地数据记录的存储管理模块。支持记录图片、音乐、视频等媒体信息，向各应用提供数据库的增删查改等接口，同时与媒体扫描、MTP等功能有关联协作关系。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储</td>
                </tr>
                <tr>
                    <td>密钥链</td>
                    <td>密码校验。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>默认打印服务</td>
                    <td>华为打印服务提供发现连接MOPRIA、EPSON和蓝牙打印机，实现文档和图片的打印功能</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>拼多多</td>
                    <td>拼多多是上海寻梦信息技术有限公司经营的电商平台。</td>
                    <td>上海寻梦信息技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>屏幕朗读</td>
                    <td>屏幕阅读器</td>
                    <td>保益互动</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，通话记录，存储</td>
                </tr>
                <tr>
                    <td>屏幕录制</td>
                    <td>提供录屏功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，麦克风，存储</td>
                </tr>
                <tr>
                    <td>情景智能</td>
                    <td>情景智能是根据当前时间、地点、事件，智能为您推荐此时此地需要服务的软件。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>取词</td>
                    <td>智慧识屏取词模块，帮助智慧识屏获取需要分析处理的文本内容。</td>
                    <td>华为终端有限公司</td>
                    <td>读取已安装应用列表，电话，信息，通讯录，通话记录</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 7">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>权限控制器</td>
                    <td>权限控制器是完成应用授权，并且提供给用户管理应用权限的软件。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>日历</td>
                    <td>查看日期，日程信息，显示地理位置、天气信息。</td>
                    <td>华为终端有限公司</td>
                    <td>读取已安装应用列表，位置信息，通讯录 ，日历，存储，网络通信</td>
                </tr>
                <tr>
                    <td>日历存储</td>
                    <td>保存日历数据。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，通讯录，日历，存储</td>
                </tr>
                <tr>
                    <td>融合定位</td>
                    <td>定位位置。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息</td>
                </tr>
                <tr>
                    <td>融合搜索服务</td>
                    <td>融合搜索服务，统一管理应用、文件数据索引，提供端侧全文搜索能力。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，信息，通讯录，日历，存储</td>
                </tr>
                <tr>
                    <td>软件更新</td>
                    <td>提供系统升级服务。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>设备连接服务</td>
                    <td>支持穿戴设备互联，提供如下功能：扫描发现穿戴设备后进行连接提醒、下载或打开对应应用、穿戴设备间因为距离太远断开连接后快速重新连接。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>设备认证服务</td>
                    <td>为登陆华为帐号的用户提供跨设备的认证支持，并为数据在设备间的同步提供有效保护方案。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储，网络通信</td>
                </tr>
                <tr>
                    <td>设置</td>
                    <td>提供系统应用设置项菜单。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，电话，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>设置存储</td>
                    <td>提供settingsProvider数据表的功能。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限读取已安装应用列表</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 8">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>升级向导</td>
                    <td>升级向导可以为您展示新版本的一些有价值的特性。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>时钟</td>
                    <td>提供闹钟功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，存储，网络通信</td>
                </tr>
                <tr>
                    <td>视频</td>
                    <td>华为视频是华为为手机用户量身打造的高品质、全程无广告的手机视频应用，旨在为用户提供精品视频观影体验。提供涵盖好莱坞电影、国内外院线大片、专属纪录片、电视剧等海量高清正版影视内容。利用华为平台终端的技术优势，为用户提供省流量、低电耗、完美画质等极致观影体验。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，电话，相机，日历，存储，网络通信</td>
                </tr>
                <tr>
                    <td>视频编辑</td>
                    <td>提供视频的裁剪、转换分辨率保存等功能，主要为图库、视频两个模块提供视频处理。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，存储，网络通信</td>
                </tr>
                <tr>
                    <td>手机管家</td>
                    <td>手机管家（平板上为平板管家）是用于帮助提升手机安全和改善用户使用体验的应用，管理手机的隐私保护，软件监控，省电管理，防骚扰以及其他权限控制等各个方面。</td>
                    <td>华为终端有限公司</td>
                    <td>应用涉及到的权限读取已安装应用列表，电话，信息，通讯录，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>手机克隆</td>
                    <td>一键将旧手机中的联系人、照片、视频、应用等数据迁移至华为新手机，轻松换机。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，信息，麦克风，相机，通讯录，历史记录、书签，日历，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>手机淘宝</td>
                    <td>手机淘宝（Android版）是阿里巴巴专为Android手机用户推出的满足其生活消费和线上购物需求的软件，具有查看附近的生活优惠信息、商品搜索、浏览、购买、支付、收藏、物流查询、旺旺沟通等在线功能，成为了用户方便快捷的生活消费入口。</td>
                    <td>淘宝（中国）软件有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>手机营业厅</td>
                    <td>中国联通手机营业厅是一款集余量、余额查询，充值交费，选号购机，生活娱乐等功能于一体的综合性服务软件。掌上联通，自由随行【查询】话费业务查询、流量查询、语音查询、积分查询、电子发票查询、资费专区、合约期查询 、业务办理记录查询；【交费】交费充值、充值卡充值【套餐】全国套餐、本地套餐、校园套餐、组合套餐、冰激凌套餐、以及品类丰富的互联网套餐；【我的】汇集全部我的业务，我的礼包。【发现】查交办之余，这里总有您意想不到的精彩</td>
                    <td>中国联合网络通信集团有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话，信息，麦克风，相机，通讯录，历史记录、书签，存储，网络通信</td>
                </tr>
                <tr>
                    <td>手势服务</td>
                    <td>用户通过手势使用功能、比如手势截屏。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>输入设备</td>
                    <td>输入设备。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限读取已安装应用列表</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 9">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>数据管理服务</td>
                    <td>通用数据管理服务：具备数据计算，数据脱敏和加密，生命周期管理，端云协同等功能，提供更高效、安全、可靠和一致性的用户体验。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>淘宝特价版</td>
                    <td>淘宝特价版由淘宝官方出品，是一款购物不仅省钱，还会送钱的特价版 APP</td>
                    <td>淘宝（中国）软件有限公司</td>
                    <td>读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>腾讯视频</td>
                    <td>腾讯视频是在线视频平台，拥有流行内容和专业的媒体运营能力，是聚合热播影视、综艺娱乐、体育赛事、新闻资讯等为一体的综合视频内容平台，高清流畅播放，极速离线缓存，支持微博、微信、朋友圈一键分享。强大全网搜索功能！</td>
                    <td>腾讯科技（北京）有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话 ，麦克风，相机，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>腾讯新闻</td>
                    <td>腾讯新闻是腾讯公司为用户精心打造的一款拥有7x24小时全方位新闻报道的新闻产品，为用户提供高效、优质的资讯服务。</td>
                    <td>腾讯科技（北京）有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话 ，麦克风，相机，存储，网络通信</td>
                </tr>
                <tr>
                    <td>天气</td>
                    <td>天气预报</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，网络通信</td>
                </tr>
                <tr>
                    <td>通过蓝牙导入</td>
                    <td>蓝牙导入基于蓝牙的一种 pbapclient端的实现，可以实现手机通过蓝牙导入联系人的操作。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，蓝牙</td>
                </tr>
                <tr>
                    <td>通话/信息存储</td>
                    <td>存储短信数据的数据库。</td>
                    <td>华为终端有限公司</td>
                    <td>应用涉及到的权限读取已安装应用列表，电话，信息，通讯录，存储</td>
                </tr>
                <tr>
                    <td>通话管理</td>
                    <td>此apk是通话应用中通话基础流程的控制部分。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限读取已安装应用列表，电话，信息，通话记录，存储，蓝牙</td>
                </tr>
                <tr>
                    <td>通话录音</td>
                    <td>通话录音是华为自研的通话录音及自动录音功能。</td>
                    <td>华为终端有限公司</td>
                    <td>读取已安装应用列表，麦克风，通讯录，通话记录，存储</td>
                </tr>
                <tr>
                    <td>图库</td>
                    <td>展示用户图片、视频等，包括本地图片相册、云端相册及共享相册。可支持图片的查看、删除、分享、复制、重命名等操作。是用户查看、管理图片的主要途径。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，通讯录 ，通话记录，存储，网络通信，蓝牙</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 10">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>图片屏保程序</td>
                    <td>互动屏保,充电状态下,屏保,需要设置。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限读取已安装应用列表，存储</td>
                </tr>
                <tr>
                    <td>推送服务</td>
                    <td>提供消息推送服务。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>外部存储设备</td>
                    <td>外部存储设备管理器。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限读取已安装应用列表，存储</td>
                </tr>
                <tr>
                    <td>微博</td>
                    <td>微博随时随地发现新鲜事，是全球的中文社交媒体平台。微博可官方发布新闻，草根爆料八卦、大V明星发布动态，粉丝狗仔爆料内幕。海量短视频等你来刷，搞笑、音乐、明星、综艺、影视、体育应有尽有、第一时间推送你最喜欢感兴趣的！</td>
                    <td>北京微梦创科网络技术有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，日历，存储，网络通信</td>
                </tr>
                <tr>
                    <td>微视</td>
                    <td>微视，让视频创作更简单，记录生活记录你，发现更有趣</td>
                    <td>腾讯科技（深圳）有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话，相机，通讯录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>位置服务</td>
                    <td>提供智能定位服务。</td>
                    <td>华为</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>文件</td>
                    <td>显示所有通过下载服务下载的文件。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>文件管理</td>
                    <td>文件管理器，提供最近、快捷访问和分类功能，为用户提供本机及云盘文件的查找和管理功能。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，相机，存储，网络通信</td>
                </tr>
                <tr>
                    <td>无线投屏</td>
                    <td>无线投屏支持局域网内的多媒体内容共享服务和屏幕镜像无线投射功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>喜马拉雅</td>
                    <td>国内领先音频分享平台，随时随地，听我想听！4亿用户选择的在线音频平台。</td>
                    <td>上海证大喜马拉雅网络技术有限公司及关联公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，存储，网络通信，蓝牙</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 11">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>系统服务</td>
                    <td>华为自研系统服务，用于对 Android系统进行系统改造和创新，打造更符合您使用习惯操作系统，让您获得更好的产品体验。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话，通话记录，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>系统用户界面</td>
                    <td>Google的原生模块，承载状态、信号栏、下拉通知栏、导航栏和多任务等。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，电话，信息，相机，通讯录，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>下载管理器</td>
                    <td>提供公用的下载服务。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限读取已安装应用列表，存储，网络通信</td>
                </tr>
                <tr>
                    <td>下载内容</td>
                    <td>提供公用的下载服务内容显示。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>下载语言</td>
                    <td>提供语言动态下载功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>相机</td>
                    <td>华为原生相机，提供拍照、录像等功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，位置信息，麦克风，相机，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>小区广播</td>
                    <td>在支持小区广播功能的国家，收到紧急预警广播后响铃警示。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限读取已安装应用列表，电话，信息</td>
                </tr>
                <tr>
                    <td>信息</td>
                    <td>短信业务应用。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，麦克风，相机，通讯录，日历，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>悬浮导航</td>
                    <td>为用户提供快捷操作、能快速进入主屏幕、回退、最近任务。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>讯飞语音引擎</td>
                    <td>语音助手应用，帮助用户通过语音执行操作。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，麦克风，存储，网络通信</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 12">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>音乐</td>
                    <td>华为音乐是提供音乐播乐内容，并支持低功耗播放、自定义歌单、MV播放、全局搜索、听歌识曲、水母动效。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>音音live</td>
                    <td>真正唱歌的网络直播互动平台，大牌明星零距离接触，更有高颜值主播与你随时互动。有颜有料又有才，尽在音音直播！</td>
                    <td>广州酷狗计算机科技有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>银联可信服务安全组件</td>
                    <td>银联可信服务安全组件</td>
                    <td>中国银联</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，存储，网络通信</td>
                </tr>
                <tr>
                    <td>应用市场</td>
                    <td>应用市场是华为官方的安卓应用查询和下载平台。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，相机，通讯录，存储，网络通信</td>
                </tr>
                <tr>
                    <td>应用助手</td>
                    <td>应用助手是华为官方的安卓游戏应用使用助手。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>用户词典</td>
                    <td>保存用户自定义词语。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>优酷视频</td>
                    <td>优酷中国第一视频网站，优酷App为7亿用户提供电视剧，电影，动漫，音乐，新闻，娱乐，游戏，原创搞笑等海量影视，高清流畅播放，极速离线缓存，支持微博、微信、朋友圈一键分享。强大全网搜索功能，优酷在手，应用尽有！
                    </td>
                    <td>优酷信息技术（北京）有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>阅读</td>
                    <td>华为阅读是华为手机内置的手机阅读软件，拥有海量免费小说以及50万多万册热门图书，支持TXT、UMD、PDF、EBK、CHM、EPUB等多种阅读格式。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>云空间</td>
                    <td>云空间，为用户提供个人数据云存储和管理服务，包括数据同步、设备数据备份、云盘和查找设备功能。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，通讯录，历史记录、书签，日历，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>云空间服务</td>
                    <td>云空间核心服务，用以支持恢复时进行应用安装、升级备份服务。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储，网络通信</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 13">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>运动健康</td>
                    <td>计步、轨迹及运动建议。</td>
                    <td>华为终端有限公司</td>
                    <td>读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，通话记录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>杂志锁屏</td>
                    <td>管理系统预置的杂志锁屏内容、提供锁屏壁纸、并提供更新和订阅功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储，网络通信</td>
                </tr>
                <tr>
                    <td>证书安装器</td>
                    <td>提供证书安装服务功能。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>支付宝</td>
                    <td>支付宝（中国）网络技术有限公司是国内领先的第三方支付平台</td>
                    <td>支付宝（中国）网络技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>支付保护中心</td>
                    <td>支付保护中心为您提供一个独立纯净的应用运行空间，隔离恶意程序，为支付、金融、财产类应用提供保护，让您的支付更安全更放心。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>指南针</td>
                    <td>提供指南针功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>智慧多窗</td>
                    <td>华为侧边栏</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>智慧生活基础服务</td>
                    <td>与华为HiLink智能网关配合，支持智能家居设备间互联互通。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>智慧识屏</td>
                    <td>智慧识屏应用提供文字识别、识图购物、全屏翻译、二维码识别等功能。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，通讯录，存储，网络通信</td>
                </tr>
                <tr>
                    <td>智慧视觉</td>
                    <td>华为智慧视觉应用提供扫码、翻译、购物、卡路里、识物功能。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，相机，通讯录，存储，网络通信</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 14">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>智慧搜索</td>
                    <td>智慧搜索APP是华为公司提供的搜索工具，可以搜索本地内容、华为云服务资源及第三方合作伙伴资源，并结合您的搜索习惯，提供相关智能搜索服务。1.
                        本地应用的内容：搜索已安装的应用、联系人、设置项、短信、邮件、备忘录、本地文件（如word文档等）。2.在线资源：华为应用市场应用、直达服务卡片、华为音乐、华为视频、主题及网页内容等。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，日历，存储，网络通信</td>
                </tr>
                <tr>
                    <td>智慧语音</td>
                    <td>智慧语音，为用户提供通过自然语言和设备进行交互的服务。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，麦克风，通讯录，通话记录，网络通信，蓝牙
                    </td>
                </tr>
                <tr>
                    <td>智能短信插件</td>
                    <td>短信能力扩展——智能短信业务</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信
                    </td>
                </tr>
                <tr>
                    <td>智能检测</td>
                    <td>手机软硬件功能检测软件</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，麦克风，相机，存储，网络通信，蓝牙
                    </td>
                </tr>
                <tr>
                    <td>智能截屏</td>
                    <td>智能截屏，您可以直接通过指关节在屏幕上画闭合图形进行自定义截屏，指关节画出的区域即为截取的区域，让截屏更加灵活易用。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储

                    </td>
                </tr>
                <tr>
                    <td>智能解锁</td>
                    <td>提供蓝牙智能解锁功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，蓝牙</td>
                </tr>
                <tr>
                    <td>主题</td>
                    <td>美化系统、可管理本地已下载的主题。在连网时可下载在线主题、壁纸、铃声、字体等。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储，网络通信</td>
                </tr>
                <tr>
                    <td>AirLink</td>
                    <td>近场通信融合软件。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>Android系统</td>
                    <td>原生系统资源APP。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，通讯录</td>
                </tr>
                <tr>
                    <td>AndroidServicesLibrary</td>
                    <td>AOSP扩展服务。</td>
                    <td>AOSP</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 15">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>AndroidSharedLibrary</td>
                    <td>AOSP扩展动态库。</td>
                    <td>AOSP</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>androidhwext</td>
                    <td>华为扩展系统资源APP。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，历史记录、书签</td>
                </tr>
                <tr>
                    <td>AutoRegSms</td>
                    <td>电信短信自注册应用，开机通过后台短信方式自动上报手机的部分信息。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，信息</td>
                </tr>
                <tr>
                    <td>BluetoothMIDIService</td>
                    <td>蓝牙设备管理应用，用于管理通过蓝牙连接至手机的音频设备。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，蓝牙</td>
                </tr>
                <tr>
                    <td>CallLogBackup/Restore</td>
                    <td>通话记录备份恢复功能，让您更换手机也不会漏掉未接来电的记录，以免漏回重要来电。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>CaptivePortalLogin</td>
                    <td>port登录应用，中国区未预置。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>com.android.backupconfirm</td>
                    <td>提供备份和恢复初始设置的功能。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.android.carrierconfig</td>
                    <td>随卡适配，配置VoLTE、RCS、VoWiFi等功能的参数。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.android.cts.ctsshim</td>
                    <td>CTS环境运行辅助APP。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.android.cts.priv.ctsshim</td>
                    <td>CTS环境运行辅助APP。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 16">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>com.android.frameworkres.overlay</td>
                    <td>定制系统资源。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.android.localtransport</td>
                    <td>谷歌备份服务。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.android.ons</td>
                    <td>手机卡优选网络服务</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.android.server.NetworkPermissionConfig</td>
                    <td>管理网络连接访问权限，用于权限控制，与网络连接管理配合使用。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.android.sharedstoragebackup</td>
                    <td>备份应用，备份手机内置存储和SD内容备份。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储</td>
                </tr>
                <tr>
                    <td>com.android.systemui.overlay</td>
                    <td>管理设备用户界面SystemUI相关的资源，如：图标大小，边距等。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.android.wallpaperbackup</td>
                    <td>壁纸备份功能</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.android.wallpapercropper</td>
                    <td>可以对图片进行裁剪，改变图片尺寸。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.huawei.androidx</td>
                    <td>通过对JetPack的使用进行统一管理，降低了应用自身ROM的大小，并优化了应用对RAM的占用。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.huawei.appgallery.overlay</td>
                    <td>支撑应用市场提供安卓应用查询和下载平台能力。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 17">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>com.huawei.educenter.overlay</td>
                    <td>教育中心APP定位于构建教与学的学习交流平台，为用户提供优质教育内容和服务的中心化平台。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.huawei.frameworkhwext.honor</td>
                    <td>通过此功能，手机应用界面可以呈现为蓝色背景白色字体的效果，让手机界面的风格更加明快活泼。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.huawei.game.kitserver</td>
                    <td>游戏性能优化</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.huawei.hff</td>
                    <td>提供HMS组件Libraries给华为自有应用集成，通过共享降低华为预置应用大小，当前提供的组件有:WisePlay、Ffmpeg等。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>com.huawei.hiviewtun nel</td>
                    <td>日志引擎上传模块，将日志引擎采集和统计的故障数据上传分析，以便清晰明了地了解和解决手机故障。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表，电话，存储，网络 通信</td>
                </tr>
                <tr>
                    <td>com.mediatek.ims.ImsApp</td>
                    <td>运营商的VoLTE业务所需要的认证应用软件。</td>
                    <td>MediaTek</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话 ，相机，网络通信</td>
                </tr>
                <tr>
                    <td>DEF</td>
                    <td>分布式执行框架。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>FeatureFramework</td>
                    <td>华为特性框架。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>FIDOUAFASM</td>
                    <td>为FIDO(快速线上身份认证)协议提供底层能力支撑。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>FIDO UAFClient</td>
                    <td>为满足FIDO(快速线 上身份认证)协议的应用提供基础能力支持，第三方应用可通过该应用绑定指纹完成在线身份认证。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表，网络通信</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 18">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>GesturalNavigationBar</td>
                    <td>导航提示条的显示功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HAware</td>
                    <td>省电精灵是系统功耗优化管控模块，管理第三方应用的唤醒、告警、提示等耗电行为，支撑手机管家省电模式和超级省电模 式的实现，保障手机续航能力。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HiCard</td>
                    <td>HiCardAPP是华为公 司提供的卡片框架服 务，该服务定义了卡片的属性、展示规则以及布局显示等内容。它可以支持多个不同的卡片服务提供方接入，也支持多个应用端订阅和查询卡片，统一规范获取卡片与渲染效果，提升更好的用户体验。卡片 服务提供方及卡片展 示方具体对应如下: 1.卡片服务提供方 :HiSuggestion 2.卡片展示方:智慧语音</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HiMoviePlayerPlus</td>
                    <td>华为视频是华为为手机用户量身打造的高品质、全程无广告的手机视频应用，旨在为用户提供精品视频观影体验。提供涵盖 好莱坞电影、国内外 院线大片、专属纪录片、电视剧等海量高清正版影视内容。利用华为平台终端的技术优势，为用户提供省流量、低电耗、完 美画质等极致观影体验。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HiMoviePlayerPlus</td>
                    <td>华为视频是华为为手机用户量身打造的高品质、全程无广告的手机视频应用，旨在为用户提供精品视频观影体验。提供涵盖 好莱坞电影、国内外院线大片、专属纪录片、电视剧等海量高清正版影视内容。利用华为平台终端的技术优势，为用户提供省流量、低电耗、完美画质等极致观影体验。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HiMoviePlayerPlus</td>
                    <td>华为视频是华为为手 机用户量身打造的高品质、全程无广告的手机视频应用，旨在为用户提供精品视频观影体验。提供涵盖好莱坞电影、国内外院线大片、专属纪录片、电视剧等海量高清正版影视内容。利用华为平台终端的技术优势，为用户提供省流量、低电耗、完美画质等极致观影体验。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HiMoviePlayerPlus</td>
                    <td>华为视频是华为为手机用户量身打造的高品质、全程无广告的手机视频应用，旨在为用户提供精品视频观影体验。提供涵盖好莱坞电影、国内外院线大片、专属纪录片、电视剧等海量高清正版影视内容。利用华为平台终端的技术优势，为用户提供省流量、低电耗、完美画质等极致观影体验。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>Histen</td>
                    <td>Huawei Histen音效设置，用户可以根据喜好设置和配置音效均衡器等信息。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，蓝牙</td>
                </tr>
                <tr>
                    <td>hiview</td>
                    <td>日志引擎，采集和统计您手机端的故障信息用于问题诊断和分析，以便为您提供更好的手机产品。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，存储，蓝牙</td>
                </tr>
                <tr>
                    <td>HMS Core</td>
                    <td>华为移动服务 (Huawei Mobile Services)为华为帐号、华为支付、华为推送等华为自有应用和第三方应用提供基础服务，包括登录帐号、支付、接收消息等。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，相机，通讯录，日历，存储，网络通信，蓝牙</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 19">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>HTML查看器</td>
                    <td>查看文本、html功能。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>HUAWEIHiAIBase</td>
                    <td>HuaweiHiAIBase模块，HuaweiHiAIEngine的基础服务，为华为智慧能力提供资源更新、电源键唤醒等基础能力。</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>HuaweiProfileServices</td>
                    <td>将端侧设备信息进行统一管理，支持设备信息的端端和端云协同，实现设备信息应用间共享。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，存储，网络通信</td>
                </tr>
                <tr>
                    <td>HuaweiSecureIME</td>
                    <td>安全输入法</td>
                    <td>华为有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HuaweiShare</td>
                    <td>应用打开方式,系统分享框功能(包含图 库分享)。</td>
                    <td>华为终端 有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HuaweiWebView</td>
                    <td>系统WebView，展示 HTML页面的系统控件。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>HwAps</td>
                    <td>显示流程中GPU及LCD等相关器件功耗优化管控应用。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HwBehaviorAuth</td>
                    <td>由bot虚假用户检测数据采集服务调用，传入触屏等数据后对数据进行融合、比对，计算分支从而判断当前用户是否为bot虚假用户。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HwCameraKit</td>
                    <td>华为相机能力开放，将人像、hdr、录像等开放给三方使用。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HwChrService</td>
                    <td>通信协议可维可测apk，用于检测异常，收集异常关键信息等。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话 ，蓝牙</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 20">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>HwCoAuthService</td>
                    <td>将分布式系统内的认证资源整合后进行协同调度，提供对用户的分布式协同认证框架功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HwGroupManager</td>
                    <td>基于EMUI的底层基础能力，管理设备间的 可信关系，提供不同 业务建立或修改设备 间可信关系的统一接口。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>HwHiAIDSEngine</td>
                    <td>智慧决策引擎，用于华为智能助手服务推荐，EMUI亮点特性推荐以及智能通知管理。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>HwNearby</td>
                    <td>为HuaweiShare、iConnect等多个应用提供设备发现连接组网传输等功能</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，通讯录，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>HwPanPayService</td>
                    <td>华为泛支付服务是一个系统基础服务，主要功能是提供支付相关功能(如支持指纹 、人脸服务)的互联网金融身份认证等。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>HwSecurityPluginBase</td>
                    <td>安全插件管理服务，用于管理EMUI安全特性相关的插件，主要负责AI病毒查杀、普通病毒查杀等三方安全插件的下载、更 新、加载、卸载及控制。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，存储，网络 通信</td>
                </tr>
                <tr>
                    <td>HwStartupGuide</td>
                    <td>首次开机时、引导用户设置语言、应用使 用权限、华为会员、数据迁移、云服务、密码或指纹等信息。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，通讯录，网络通信</td>
                </tr>
                <tr>
                    <td>HwSynergy</td>
                    <td>华为消息同步应用，可以帮您将手机端的通知、短信、来电、闹钟、情景智能等消息同步到您的穿戴设备上，让您无须解锁手机，即可知道消息内容。除此之外，您还可以通过穿戴设备对手机进行电话、闹钟、拍照或找手机等操作，帮助您更加便捷的使用和控制手机。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，信息，通讯录，通话记录，蓝牙</td>
                </tr>
                <tr>
                    <td>HwWifiproBqeService</td>
                    <td>WiFi+智能评分是WiFi+功能子模块，用于WebView加载Url，制造上网行为，评估WiFi质量以及Portal检测的容错。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>iAware</td>
                    <td>协助管理手机系统资源，提升手机性能</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 21">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>IntentFilterVerificationService</td>
                    <td>googleMApp链接的功能。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>Link Now</td>
                    <td>Link Now is a consumer-level application that provides various education resourcesand enables users to learn and collaborate anytime, anywhere and in any form.</td>
                    <td>Huawei Software Technolo gy Co., Ltd.</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，麦克风，相机，通讯录，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>LiveWallpaperPicker</td>
                    <td>提供桌面动态壁纸。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>LPPeService</td>
                    <td>提供系统AGPS相关服务。</td>
                    <td>联发科</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，信息，通话记录，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>MMITest</td>
                    <td>支撑器件类测试功能，保证发货手机基本器件功能正常。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，蓝牙</td>
                </tr>
                <tr>
                    <td>MmsService</td>
                    <td>MMS服务。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，信息</td>
                </tr>
                <tr>
                    <td>ModuleMetadata</td>
                    <td>仅用于承载Mainline Module版本号信息。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>MTK NLPService</td>
                    <td>优化用户定位性能体验</td>
                    <td>联发科</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，网络通信</td>
                </tr>
                <tr>
                    <td>MTP 服务</td>
                    <td>为MTP数据连接提供支撑服务。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>NetworkStack</td>
                    <td>管理网络连接。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 22">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>One Time Init</td>
                    <td>首次启动时用于安装谷歌应用。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>PacProcessor</td>
                    <td>解析数据代理脚本。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>PrintServiceRecommendationService</td>
                    <td>AOSP Cloud Print链接服务。</td>
                    <td>AOSP</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>ProxyHandler</td>
                    <td>将数据代理服务器设置到kernel。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，网络通信</td>
                </tr>
                <tr>
                    <td>QQ浏览器</td>
                    <td>QQ浏览器旨在带来更轻、更快、更安全、更好玩的浏览体验。</td>
                    <td>TencentTechnology(Shenzhen)CompanyLimited</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，麦克风，相机，通讯录，存储，网络通信</td>
                </tr>
                <tr>
                    <td>RegService</td>
                    <td>运营商为了改进通信服务质量或提供用户自定义服务或技术，可能会通过该应用获取您设备的相关信息。运营商承诺仅将相关信息用以服务分析，不会以任何可识别个人身份的形式向 外界披露。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>RemotePassword</td>
                    <td>提供跨设备认证用户 设置的锁屏密码的功能。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>SecureElementService</td>
                    <td>支持钱包应用智能卡相关功能，如:运营商钱包应用访问 SIM卡、华为/荣耀钱包访问eSE。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>Shell</td>
                    <td>提供adb shell的手机侧功能。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，信息，通讯录，日历，存储，网络通信，蓝牙</td>
                </tr>
                <tr>
                    <td>SIM卡管理</td>
                    <td>SIM管理是对SIM卡的状态、5G/4G、数据业务和卡信息进行管理。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话</td>
                </tr>
            </table>
            <table cellpadding="0" cellspacing="0" v-show="index == 23">
                <thead>
                <th>应用名称</th>
                <th>功能描述</th>
                <th>开发者信息</th>
                <th>权限列表</th>
                </thead>
                <tr>
                    <td>SIM卡应用</td>
                    <td>运营商SIM卡相关应用。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表，存储</td>
                </tr>
                <tr>
                    <td>TelephonyAssist</td>
                    <td>同步数据业务开关状态、漫游状态，屏幕亮灭状态给底层modem。</td>
                    <td>MediaTek</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>TrustedDeviceAuth</td>
                    <td>负责分布式场景下设备间的身份认证，支撑分布式设备间的可信互联。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限: 读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>UEInfoCheck</td>
                    <td>电信数据业务自注册，开机后通过数据业务自动上报手机的部分信息。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，电话，网络通信</td>
                </tr>
                <tr>
                    <td>VpnDialogs</td>
                    <td>开启VPN时弹出的确认对话框。</td>
                    <td>谷歌</td>
                    <td>该应用涉及到的权限:读取已安装应用列表</td>
                </tr>
                <tr>
                    <td>WalletSDK</td>
                    <td>手机恢复出厂设置时，清理手机eSE和inSE芯片中的卡片数据，即:华为钱包应用会恢复到出厂状态，之前添加的银行卡等卡片数据会清除</td>
                    <td>华为软件技术有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，网络通信</td>
                </tr>
                <tr>
                    <td>WLAN直连</td>
                    <td>WLAN直连可支持华为设备之间数据传输 。</td>
                    <td>华为终端有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，位置信息，通讯录，存储，网络通信</td>
                </tr>
                <tr>
                    <td>WPSOffice</td>
                    <td>WPS应用为商务工具类应用，是一款办公软件，可以实现办公软件最常用的文字、表格、演示等多种功能，免费提供海量在线存储空间及文档模板</td>
                    <td>珠海金山办公软件有限公司</td>
                    <td>该应用涉及到的权限:读取已安装应用列表，电话，麦克风，相机，存储，网络通信</td>
                </tr>
            </table>
        </div>
        <div class="page">
            <div class="prev-btn" @click="prevPage">
                <img :class="index==1?'opacity':''" src="../assets/arrow-left.png" alt="">
            </div>
            <div class="current-page">
                <input type="text" @keyup="gotoPage($event,0)" @keyup.enter="gotoPage($event,1)" v-model="inputIndex"> / {{totalSize}}
            </div>
            <div class="next-btn" @click="nextPage">
                <img :class="index==totalSize?'opacity':''" src="../assets/arrow-right2.png" alt="">
            </div>
        </div>
        <Footer />
        <ReturnTop/>
    </div>
</template>

<script>
    import HeaderA from '@/components/header.vue';
    import Footer from '@/components/footer.vue';
    import ReturnTop from '@/components/return-top.vue';

    export default {
        name: "info1",
        data() {
            return {
                index: 1,
                totalSize:23,
                inputIndex: 1
            }
        },
        components: {
            // Header,
            HeaderA,
            Footer,
            ReturnTop
        },
        methods: {
            nextPage() {
                if(this.index<this.totalSize){
                    this.index += 1
                    this.inputIndex +=1
                document.body.scrollIntoView()
                }
            },
            prevPage() {
                if(this.index != 1){
                    this.index -= 1
                    this.inputIndex -=1
                document.body.scrollIntoView()
                }
            },
            gotoPage(e,type){
                let num = Number(this.inputIndex)
                if(num && num>0 && num<= this.totalSize){
                    if(!this.inputIndex){
                        if(type){
                            this.index = 1
                            document.body.scrollIntoView()
                        }
                    } else {
                        if(type){
                            this.index = this.inputIndex
                            document.body.scrollIntoView()
                        }
                    }
                } else {
                    if(type){
                        this.inputIndex = 1
                        this.index = 1
                        document.body.scrollIntoView()
                    }
                }
            }
        }
    }
</script>

<style scoped lang="less">
    .info1{
        .title{
            width: 100%;
            font-size: 28px;
            color: #000000;
            text-align: center;
            line-height: 38px;
            font-weight: bold;
            padding: 55px 0 50px 0;
        }
        .table-wrap {
            width: 792px;
            padding: 20px;
            margin: 0 auto;
            table {
                width: 100%;
                border-right: 1px solid #ccc;
                border-top: 1px solid #ccc;
                th:nth-child(1){
                    width: 15%;
                }
                th:nth-child(2){
                    width: 35%;
                }
                th:nth-child(3){
                    width: 20%;
                }
                th:nth-child(4){
                    width: 30%;
                }
                th, td {
                    border-bottom: 1px solid #ccc;
                    border-left: 1px solid #ccc;
                    vertical-align: middle;
                    color: #000000;
                    text-align: center;
                    line-height: 20px;
                    padding: 20px;
                }
                th{
                    font-size: 16px;
                }
                td{
                    font-size: 15px;
                    font-weight: 500;
                    word-break: break-all;
                }
            }
        }
        .page{
            margin: 50px 0;
            width: 100%;
            display: flex;
            justify-content: center;
            align-items: center;
            height: 36px;
            .prev-btn, .next-btn{
                cursor: pointer;
            }
            .opacity{
                opacity:0.5;
            }
            .current-page{
                display: inline-block;
                font-size: 16px;
                color: #000;
                text-align: center;
                line-height: 23px;
                margin: 0 60px;
                font-weight: 500;
                input{
                    border: 1px solid rgba(0,0,0,0.20);
                    border-radius: 2px;
                    width: 36px;
                    height: 36px;
                    text-align: center;
                    font-weight: 500;
                    color: #000;
                    font-size: 16px;
                }
            }
        }
    }
    @media screen and (max-width:750px){
        .info1{
            .title{
                color: #000000;
                text-align: center;
                font-weight: bold;
                font-size: 19px;
                line-height: 25px;
                padding: 20px;
            }
            .table-wrap {
                width: 100%;
                padding: 20px;
                margin: 0 auto;
                table {
                    width: 100%;
                    border: 0;
                    th:nth-child(1){
                        width: 15%;
                    }
                    th:nth-child(2){
                        width: 35%;
                    }
                    th:nth-child(3){
                        width: 20%;
                    }
                    th:nth-child(4){
                        width: 30%;
                    }
                    th, td {
                        border: 0;
                        vertical-align: middle;
                        color: #000000;
                        text-align: center;
                        line-height: 20px;
                        padding: 10px 0;
                    }
                    th{
                        font-size: 16px;
                        display: none;
                    }
                    tr{
                        display: flex;
                        flex-direction: column;
                        width: 100%;
                        align-items: flex-start;
                    }
                    td{
                        font-size: 12px;
                        word-break: break-all;
                        display: flex;
                        width: 100%;
                        flex-direction: column;
                        text-align: left;
                    }
                    td:nth-child(1){
                        text-align: center;
                        justify-content: center;
                        font-size: 16px;
                    }
                    td:nth-child(2)::before{
                        content: '功能描述';
                        width: 100%;
                        padding-top: 6px;
                        font-weight: bold;
                        font-size: 13px;
                    }
                    td:nth-child(3)::before{
                        content: '开发者信息';
                        width: 100%;
                        padding-top: 6px;
                        font-weight: bold;
                        font-size: 13px;
                    }
                    td:nth-child(4)::before{
                        content: '权限列表';
                        width: 100%;
                        padding-top: 6px;
                        font-weight: bold;
                        font-size: 13px;
                    }
                }
            }
            .page{
                margin: 50px 0;
                width: 100%;
                display: flex;
                justify-content: center;
                align-items: center;
                height: 36px;
                .prev-btn, .next-btn{
                    cursor: pointer;
                }
                .opacity{
                    opacity:0.5;
                }
                .current-page{
                    display: inline-block;
                    font-size: 16px;
                    color: #000;
                    text-align: center;
                    line-height: 23px;
                    margin: 0 60px;
                    font-weight: 500;
                    input{
                        border: 1px solid rgba(0,0,0,0.20);
                        border-radius: 2px;
                        width: 36px;
                        height: 36px;
                        text-align: center;
                        font-weight: 500;
                        color: #000;
                        font-size: 16px;
                    }
                }
            }
        }

    }
</style>