const proList = [{
        title: '投屏时手机“拿起手机亮屏”功能失效',
        con: '<p class="b-t">问题现象：</p>已经开启拿起手机亮屏功能，投屏时，手机到达设置的休眠时间灭屏，此时拿起手机亮屏功能失效。<p class="b-t">解决方案：</p>点击电源键可点亮手机屏幕。',
    }, {
        title: '同种型号机器的不同后盖之间存在色差/偏色/颜色差异',
        con: '后盖采用特殊镀膜工艺，工艺要求非常苛刻，即使在严格的质量管控下，也只能把颜色差异控制在一定范围内，在不同的角度或光照条件下，可能存在一定的颜色差异或视觉差异。这是正常现象，不会影响手机的正常使用，请放心使用。'
    }, {
        title: '下拉通知栏自动亮度勾选框没有了',
        con: '<p class="b-t">问题现象：</p>下拉通知栏自动亮度条可以手动调节亮度，但是没有自动亮度勾选框了。<p class="b-t">问题原因：</p>在新的系统版本中，下拉通知栏提供快捷调节亮度的亮度条，不再提供自动亮度勾选框。<p class="b-t">解决方案：</p>您需要自动调节亮度，请您在“设置”中搜索并进入“亮度”/显示和亮度，打开或关闭“自动调节”。'
    }, {
        title: '4 手机无线投屏后，大屏上的照片不能随着手机旋转而旋转',
        con: '<p class="b-t">问题现象：</p>手机无线投屏后，大屏上的照片不能随着手机旋转而旋转。<p class="b-t">问题原因：</p>如果您使用的是DLNA协议连接大屏，该协议不支持大屏端的显示跟随手机屏幕旋转而转变方向。<p class="b-t">解决方案：</p>如果您的大屏设备支持其他协议，建议您使用其他投屏协议进行连接，在选择连接投屏设备时选择支持电脑模式或者手机模式投屏，此模式下大屏端显示可跟随手机屏幕转变方向。'
    },
    {
        title: '5 手机通话声音与微信语音投屏播放出现混音',
        con: '<p class="b-t">问题现象：</p>在手机投屏模式下，手机通话时打开微信播放语音信息，会出现混音现象。<p class="b-t">问题原因：</p>如果使用听筒接听电话，此时打开微信语音，微信语音会从大屏输出，再将手机靠近耳朵接听电话，微信会识别到接近听筒的动作而将微信语音输出切换到听筒，就会导致通话音和微信语音都从听筒输出，出现混音现象。<br>如果在手机端播放微信语音，此时电话来电，则微信语音会被打断。<br>如果使用免提接听电话，此时打开微信语音，微信语音会从大屏输出。<p class="b-t">解决方案：</p>如果您想在接听电话时播放微信语音，您可以选择打开免提接听电话，此时微信语音会从大屏输出，不会造成混音现象。不过为了保证您的通话质量，建议您通话完成后再接听微信语音。'
    },
]
export default proList